JavierVicandi/ORIBAY_20200083_JMZ20/3-Software/CW/TM3/Project_Headers/mc9s12zvls16.h
/*** PWM0CLKAB - PWM0 Clock A/B Select Register; 0x00000486 ***/
typedef union {
  byte Byte;
  struct {
    byte PCLKAB0     :1;                                       /* Pulse Width Channel 0 Clock A/B Select */
    byte PCLKAB1     :1;                                       /* Pulse Width Channel 1 Clock A/B Select */
    byte PCLKAB2     :1;                                       /* Pulse Width Channel 2 Clock A/B Select */
    byte PCLKAB3     :1;                                       /* Pulse Width Channel 3 Clock A/B Select */
    byte PCLKAB4     :1;                                       /* Pulse Width Channel 4 Clock A/B Select */
    byte PCLKAB5     :1;                                       /* Pulse Width Channel 5 Clock A/B Select */
    byte PCLKAB6     :1;                                       /* Pulse Width Channel 6 Clock A/B Select */
    byte PCLKAB7     :1;                                       /* Pulse Width Channel 7 Clock A/B Select */
  } Bits;
} PWM0CLKABSTR;
extern volatile PWM0CLKABSTR _PWM0CLKAB @0x00000486;
#define PWM0CLKAB                       _PWM0CLKAB.Byte
#define PWM0CLKAB_PCLKAB0               _PWM0CLKAB.Bits.PCLKAB0
#define PWM0CLKAB_PCLKAB1               _PWM0CLKAB.Bits.PCLKAB1
#define PWM0CLKAB_PCLKAB2               _PWM0CLKAB.Bits.PCLKAB2
#define PWM0CLKAB_PCLKAB3               _PWM0CLKAB.Bits.PCLKAB3
#define PWM0CLKAB_PCLKAB4               _PWM0CLKAB.Bits.PCLKAB4
#define PWM0CLKAB_PCLKAB5               _PWM0CLKAB.Bits.PCLKAB5
#define PWM0CLKAB_PCLKAB6               _PWM0CLKAB.Bits.PCLKAB6
#define PWM0CLKAB_PCLKAB7               _PWM0CLKAB.Bits.PCLKAB7

#define PWM0CLKAB_PCLKAB0_MASK          1U
#define PWM0CLKAB_PCLKAB1_MASK          2U
#define PWM0CLKAB_PCLKAB2_MASK          4U
#define PWM0CLKAB_PCLKAB3_MASK          8U
#define PWM0CLKAB_PCLKAB4_MASK          16U
#define PWM0CLKAB_PCLKAB5_MASK          32U
#define PWM0CLKAB_PCLKAB6_MASK          64U
#define PWM0CLKAB_PCLKAB7_MASK          128U


/*** PWM0SCLA - PWM0 Scale A Register; 0x00000488 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* PWM0 Scale A Bit 0 */
    byte BIT1        :1;                                       /* PWM0 Scale A Bit 1 */
    byte BIT2        :1;                                       /* PWM0 Scale A Bit 2 */
    byte BIT3        :1;                                       /* PWM0 Scale A Bit 3 */
    byte BIT4        :1;                                       /* PWM0 Scale A Bit 4 */
    byte BIT5        :1;                                       /* PWM0 Scale A Bit 5 */
    byte BIT6        :1;                                       /* PWM0 Scale A Bit 6 */
    byte BIT7        :1;                                       /* PWM0 Scale A Bit 7 */
  } Bits;
} PWM0SCLASTR;
extern volatile PWM0SCLASTR _PWM0SCLA @0x00000488;
#define PWM0SCLA                        _PWM0SCLA.Byte
#define PWM0SCLA_BIT0                   _PWM0SCLA.Bits.BIT0
#define PWM0SCLA_BIT1                   _PWM0SCLA.Bits.BIT1
#define PWM0SCLA_BIT2                   _PWM0SCLA.Bits.BIT2
#define PWM0SCLA_BIT3                   _PWM0SCLA.Bits.BIT3
#define PWM0SCLA_BIT4                   _PWM0SCLA.Bits.BIT4
#define PWM0SCLA_BIT5                   _PWM0SCLA.Bits.BIT5
#define PWM0SCLA_BIT6                   _PWM0SCLA.Bits.BIT6
#define PWM0SCLA_BIT7                   _PWM0SCLA.Bits.BIT7

#define PWM0SCLA_BIT0_MASK              1U
#define PWM0SCLA_BIT1_MASK              2U
#define PWM0SCLA_BIT2_MASK              4U
#define PWM0SCLA_BIT3_MASK              8U
#define PWM0SCLA_BIT4_MASK              16U
#define PWM0SCLA_BIT5_MASK              32U
#define PWM0SCLA_BIT6_MASK              64U
#define PWM0SCLA_BIT7_MASK              128U


/*** PWM0SCLB - PWM0 Scale B Register; 0x00000489 ***/
typedef union {
  byte Byte;
  struct {
    byte BIT0        :1;                                       /* PWM0 Scale B Bit 0 */
    byte BIT1        :1;                                       /* PWM0 Scale B Bit 1 */
    byte BIT2        :1;                                       /* PWM0 Scale B Bit 2 */
    byte BIT3        :1;                                       /* PWM0 Scale B Bit 3 */
    byte BIT4        :1;                                       /* PWM0 Scale B Bit 4 */
    byte BIT5        :1;                                       /* PWM0 Scale B Bit 5 */
    byte BIT6        :1;                                       /* PWM0 Scale B Bit 6 */
    byte BIT7        :1;                                       /* PWM0 Scale B Bit 7 */
  } Bits;
} PWM0SCLBSTR;
extern volatile PWM0SCLBSTR _PWM0SCLB @0x00000489;
#define PWM0SCLB                        _PWM0SCLB.Byte
#define PWM0SCLB_BIT0                   _PWM0SCLB.Bits.BIT0
#define PWM0SCLB_BIT1                   _PWM0SCLB.Bits.BIT1
#define PWM0SCLB_BIT2                   _PWM0SCLB.Bits.BIT2
#define PWM0SCLB_BIT3                   _PWM0SCLB.Bits.BIT3
#define PWM0SCLB_BIT4                   _PWM0SCLB.Bits.BIT4
#define PWM0SCLB_BIT5                   _PWM0SCLB.Bits.BIT5
#define PWM0SCLB_BIT6                   _PWM0SCLB.Bits.BIT6
#define PWM0SCLB_BIT7                   _PWM0SCLB.Bits.BIT7

#define PWM0SCLB_BIT0_MASK              1U
#define PWM0SCLB_BIT1_MASK              2U
#define PWM0SCLB_BIT2_MASK              4U
#define PWM0SCLB_BIT3_MASK              8U
#define PWM0SCLB_BIT4_MASK              16U
#define PWM0SCLB_BIT5_MASK              32U
#define PWM0SCLB_BIT6_MASK              64U
#define PWM0SCLB_BIT7_MASK              128U


/*** PWM0CNT01 - PWM0 Channel Counter 01 Register; 0x0000048C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0CNT0 - PWM0 Channel Counter 0 Register; 0x0000048C ***/
    union {
      byte Byte;
    } PWM0CNT0STR;
    #define PWM0CNT0                    _PWM0CNT01.Overlap_STR.PWM0CNT0STR.Byte
    /* PWM0CNT_ARR: Access 8 PWM0CNTx registers in an array */
    #define PWM0CNT_ARR                 ((volatile byte *) &PWM0CNT0)
    

    /*** PWM0CNT1 - PWM0 Channel Counter 1 Register; 0x0000048D ***/
    union {
      byte Byte;
    } PWM0CNT1STR;
    #define PWM0CNT1                    _PWM0CNT01.Overlap_STR.PWM0CNT1STR.Byte
    
  } Overlap_STR;

} PWM0CNT01STR;
extern volatile PWM0CNT01STR _PWM0CNT01 @0x0000048C;
#define PWM0CNT01                       _PWM0CNT01.Word


/*** PWM0CNT23 - PWM0 Channel Counter 23 Register; 0x0000048E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0CNT2 - PWM0 Channel Counter 2 Register; 0x0000048E ***/
    union {
      byte Byte;
    } PWM0CNT2STR;
    #define PWM0CNT2                    _PWM0CNT23.Overlap_STR.PWM0CNT2STR.Byte
    

