JavierVicandi/ORIBAY_20200083_JMZ20/3-Software/CW/TM3/Project_Headers/mc9s12zvls16.h
    /*** PWM0CNT3 - PWM0 Channel Counter 3 Register; 0x0000048F ***/
    union {
      byte Byte;
    } PWM0CNT3STR;
    #define PWM0CNT3                    _PWM0CNT23.Overlap_STR.PWM0CNT3STR.Byte
    
  } Overlap_STR;

} PWM0CNT23STR;
extern volatile PWM0CNT23STR _PWM0CNT23 @0x0000048E;
#define PWM0CNT23                       _PWM0CNT23.Word


/*** PWM0CNT45 - PWM0 Channel Counter 45 Register; 0x00000490 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0CNT4 - PWM0 Channel Counter 4 Register; 0x00000490 ***/
    union {
      byte Byte;
    } PWM0CNT4STR;
    #define PWM0CNT4                    _PWM0CNT45.Overlap_STR.PWM0CNT4STR.Byte
    

    /*** PWM0CNT5 - PWM0 Channel Counter 5 Register; 0x00000491 ***/
    union {
      byte Byte;
    } PWM0CNT5STR;
    #define PWM0CNT5                    _PWM0CNT45.Overlap_STR.PWM0CNT5STR.Byte
    
  } Overlap_STR;

} PWM0CNT45STR;
extern volatile PWM0CNT45STR _PWM0CNT45 @0x00000490;
#define PWM0CNT45                       _PWM0CNT45.Word


/*** PWM0CNT67 - PWM0 Channel Counter 67 Register; 0x00000492 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0CNT6 - PWM0 Channel Counter 6 Register; 0x00000492 ***/
    union {
      byte Byte;
    } PWM0CNT6STR;
    #define PWM0CNT6                    _PWM0CNT67.Overlap_STR.PWM0CNT6STR.Byte
    

    /*** PWM0CNT7 - PWM0 Channel Counter 7 Register; 0x00000493 ***/
    union {
      byte Byte;
    } PWM0CNT7STR;
    #define PWM0CNT7                    _PWM0CNT67.Overlap_STR.PWM0CNT7STR.Byte
    
  } Overlap_STR;

} PWM0CNT67STR;
extern volatile PWM0CNT67STR _PWM0CNT67 @0x00000492;
#define PWM0CNT67                       _PWM0CNT67.Word


/*** PWM0PER01 - PWM0 Channel Period 01 Register; 0x00000494 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0PER0 - PWM0 Channel Period 0 Register; 0x00000494 ***/
    union {
      byte Byte;
    } PWM0PER0STR;
    #define PWM0PER0                    _PWM0PER01.Overlap_STR.PWM0PER0STR.Byte
    /* PWM0PER_ARR: Access 8 PWM0PERx registers in an array */
    #define PWM0PER_ARR                 ((volatile byte *) &PWM0PER0)
    

    /*** PWM0PER1 - PWM0 Channel Period 1 Register; 0x00000495 ***/
    union {
      byte Byte;
    } PWM0PER1STR;
    #define PWM0PER1                    _PWM0PER01.Overlap_STR.PWM0PER1STR.Byte
    
  } Overlap_STR;

} PWM0PER01STR;
extern volatile PWM0PER01STR _PWM0PER01 @0x00000494;
#define PWM0PER01                       _PWM0PER01.Word


/*** PWM0PER23 - PWM0 Channel Period 23 Register; 0x00000496 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0PER2 - PWM0 Channel Period 2 Register; 0x00000496 ***/
    union {
      byte Byte;
    } PWM0PER2STR;
    #define PWM0PER2                    _PWM0PER23.Overlap_STR.PWM0PER2STR.Byte
    

    /*** PWM0PER3 - PWM0 Channel Period 3 Register; 0x00000497 ***/
    union {
      byte Byte;
    } PWM0PER3STR;
    #define PWM0PER3                    _PWM0PER23.Overlap_STR.PWM0PER3STR.Byte
    
  } Overlap_STR;

} PWM0PER23STR;
extern volatile PWM0PER23STR _PWM0PER23 @0x00000496;
#define PWM0PER23                       _PWM0PER23.Word


/*** PWM0PER45 - PWM0 Channel Period 45 Register; 0x00000498 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0PER4 - PWM0 Channel Period 4 Register; 0x00000498 ***/
    union {
      byte Byte;
    } PWM0PER4STR;
    #define PWM0PER4                    _PWM0PER45.Overlap_STR.PWM0PER4STR.Byte
    

    /*** PWM0PER5 - PWM0 Channel Period 5 Register; 0x00000499 ***/
    union {
      byte Byte;
    } PWM0PER5STR;
    #define PWM0PER5                    _PWM0PER45.Overlap_STR.PWM0PER5STR.Byte
    
  } Overlap_STR;

} PWM0PER45STR;
extern volatile PWM0PER45STR _PWM0PER45 @0x00000498;
#define PWM0PER45                       _PWM0PER45.Word


/*** PWM0PER67 - PWM0 Channel Period 67 Register; 0x0000049A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0PER6 - PWM0 Channel Period 6 Register; 0x0000049A ***/
    union {
      byte Byte;
    } PWM0PER6STR;
    #define PWM0PER6                    _PWM0PER67.Overlap_STR.PWM0PER6STR.Byte
    

    /*** PWM0PER7 - PWM0 Channel Period 7 Register; 0x0000049B ***/
    union {
      byte Byte;
    } PWM0PER7STR;
    #define PWM0PER7                    _PWM0PER67.Overlap_STR.PWM0PER7STR.Byte
    
  } Overlap_STR;

} PWM0PER67STR;
extern volatile PWM0PER67STR _PWM0PER67 @0x0000049A;
#define PWM0PER67                       _PWM0PER67.Word


/*** PWM0DTY01 - PWM0 Channel Duty 01 Register; 0x0000049C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0DTY0 - PWM0 Channel Duty 0 Register; 0x0000049C ***/
    union {
      byte Byte;
    } PWM0DTY0STR;
    #define PWM0DTY0                    _PWM0DTY01.Overlap_STR.PWM0DTY0STR.Byte
    /* PWM0DTY_ARR: Access 8 PWM0DTYx registers in an array */
    #define PWM0DTY_ARR                 ((volatile byte *) &PWM0DTY0)
    

    /*** PWM0DTY1 - PWM0 Channel Duty 1 Register; 0x0000049D ***/
    union {
      byte Byte;
    } PWM0DTY1STR;
    #define PWM0DTY1                    _PWM0DTY01.Overlap_STR.PWM0DTY1STR.Byte
    
  } Overlap_STR;

} PWM0DTY01STR;
extern volatile PWM0DTY01STR _PWM0DTY01 @0x0000049C;
#define PWM0DTY01                       _PWM0DTY01.Word


/*** PWM0DTY23 - PWM0 Channel Duty 23 Register; 0x0000049E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0DTY2 - PWM0 Channel Duty 2 Register; 0x0000049E ***/
    union {
      byte Byte;
    } PWM0DTY2STR;
    #define PWM0DTY2                    _PWM0DTY23.Overlap_STR.PWM0DTY2STR.Byte
    

    /*** PWM0DTY3 - PWM0 Channel Duty 3 Register; 0x0000049F ***/
    union {
      byte Byte;
    } PWM0DTY3STR;
    #define PWM0DTY3                    _PWM0DTY23.Overlap_STR.PWM0DTY3STR.Byte
    
  } Overlap_STR;

} PWM0DTY23STR;
extern volatile PWM0DTY23STR _PWM0DTY23 @0x0000049E;
#define PWM0DTY23                       _PWM0DTY23.Word


/*** PWM0DTY45 - PWM0 Channel Duty 45 Register; 0x000004A0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0DTY4 - PWM0 Channel Duty 4 Register; 0x000004A0 ***/
    union {
      byte Byte;
    } PWM0DTY4STR;
    #define PWM0DTY4                    _PWM0DTY45.Overlap_STR.PWM0DTY4STR.Byte
    

    /*** PWM0DTY5 - PWM0 Channel Duty 5 Register; 0x000004A1 ***/
    union {
      byte Byte;
    } PWM0DTY5STR;
    #define PWM0DTY5                    _PWM0DTY45.Overlap_STR.PWM0DTY5STR.Byte
    
  } Overlap_STR;

} PWM0DTY45STR;
extern volatile PWM0DTY45STR _PWM0DTY45 @0x000004A0;
#define PWM0DTY45                       _PWM0DTY45.Word


/*** PWM0DTY67 - PWM0 Channel Duty 67 Register; 0x000004A2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PWM0DTY6 - PWM0 Channel Duty 6 Register; 0x000004A2 ***/
    union {
      byte Byte;
    } PWM0DTY6STR;
    #define PWM0DTY6                    _PWM0DTY67.Overlap_STR.PWM0DTY6STR.Byte
    

    /*** PWM0DTY7 - PWM0 Channel Duty 7 Register; 0x000004A3 ***/
    union {
      byte Byte;
    } PWM0DTY7STR;
    #define PWM0DTY7                    _PWM0DTY67.Overlap_STR.PWM0DTY7STR.Byte
    
  } Overlap_STR;

} PWM0DTY67STR;
extern volatile PWM0DTY67STR _PWM0DTY67 @0x000004A2;
#define PWM0DTY67                       _PWM0DTY67.Word


/*** TIM0TIOS - Timer Input Capture/Output Compare Select; 0x000005C0 ***/
typedef union {
  byte Byte;
  struct {
    byte IOS0        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 0 */
    byte IOS1        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 1 */
    byte IOS2        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 2 */
    byte IOS3        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 3 */
    byte IOS4        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 4 */
    byte IOS5        :1;                                       /* Input Capture or Output Compare Channel Configuration Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpIOS  :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM0TIOSSTR;
