JavierVicandi/ORIBAY_20200083_JMZ20/3-Software/CW/TM3/Project_Headers/mc9s12zvls16.h
/*** NVFSEC - Non Volatile Flash Security Register; 0x00FFFE0F ***/
typedef union {
  byte Byte;
  struct {
    byte SEC0        :1;                                       /* Flash Security Bit 0 */
    byte SEC1        :1;                                       /* Flash Security Bit 1 */
    byte RNV2        :1;                                       /* Reserved Nonvolatile Bit 2 */
    byte RNV3        :1;                                       /* Reserved Nonvolatile Bit 3 */
    byte RNV4        :1;                                       /* Reserved Nonvolatile Bit 4 */
    byte RNV5        :1;                                       /* Reserved Nonvolatile Bit 5 */
    byte KEYEN0      :1;                                       /* Backdoor Key Security Enable Bit 0 */
    byte KEYEN1      :1;                                       /* Backdoor Key Security Enable Bit 1 */
  } Bits;
  struct {
    byte grpSEC  :2;
    byte grpRNV_2 :4;
    byte grpKEYEN :2;
  } MergedBits;
} NVFSECSTR;
/* Tip for register initialization in the user code:  const byte NVFSEC_INIT @0x00FFFE0F = <NVFSEC_INITVAL>; */
#define _NVFSEC (*(const NVFSECSTR *)0x00FFFE0F)
#define NVFSEC                          _NVFSEC.Byte
#define NVFSEC_SEC0                     _NVFSEC.Bits.SEC0
#define NVFSEC_SEC1                     _NVFSEC.Bits.SEC1
#define NVFSEC_RNV2                     _NVFSEC.Bits.RNV2
#define NVFSEC_RNV3                     _NVFSEC.Bits.RNV3
#define NVFSEC_RNV4                     _NVFSEC.Bits.RNV4
#define NVFSEC_RNV5                     _NVFSEC.Bits.RNV5
#define NVFSEC_KEYEN0                   _NVFSEC.Bits.KEYEN0
#define NVFSEC_KEYEN1                   _NVFSEC.Bits.KEYEN1
#define NVFSEC_SEC                      _NVFSEC.MergedBits.grpSEC
#define NVFSEC_RNV_2                    _NVFSEC.MergedBits.grpRNV_2
#define NVFSEC_KEYEN                    _NVFSEC.MergedBits.grpKEYEN
#define NVFSEC_RNV                      NVFSEC_RNV_2

#define NVFSEC_SEC0_MASK                1U
#define NVFSEC_SEC1_MASK                2U
#define NVFSEC_RNV2_MASK                4U
#define NVFSEC_RNV3_MASK                8U
#define NVFSEC_RNV4_MASK                16U
#define NVFSEC_RNV5_MASK                32U
#define NVFSEC_KEYEN0_MASK              64U
#define NVFSEC_KEYEN1_MASK              128U
#define NVFSEC_SEC_MASK                 3U
#define NVFSEC_SEC_BITNUM               0U
#define NVFSEC_RNV_2_MASK               60U
#define NVFSEC_RNV_2_BITNUM             2U
#define NVFSEC_KEYEN_MASK               192U
#define NVFSEC_KEYEN_BITNUM             6U


/* * * * *  24-BIT ADDRESS REGISTERS  * * * * * * * * * * * * * * * * * * * * * * */
extern volatile void* volatile MMCPC @0x00000085;          /* Captured S12ZCPU Program Counter Low; 0x00000087 */
extern volatile void* volatile DBGAA @0x00000115;          /* Debug Comparator A Address Register Low; 0x00000117 */
extern volatile void* volatile DBGBA @0x00000125;          /* Debug Comparator B Address Register Low; 0x00000127 */
extern volatile void* volatile DBGDA @0x00000145;          /* Debug Comparator D Address Register Low; 0x00000147 */
extern volatile void* volatile ECCDPTR @0x000003C7;        /* ECC Debug Pointer Register Low; 0x000003C9 */
extern volatile void* volatile ADC0CBP @0x0000061D;        /* ADC0 Command Base Pointer Register 0; 0x000003C9 */
extern volatile void* volatile ADC0RBP @0x00000621;        /* ADC0 Result Base Pointer Register 0; 0x000003C9 */


  /* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (CPMUARMCOP = 0x55U, CPMUARMCOP = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */

/* **** 05/12/2014 06:12:00 PM */
#define DBGC1_EEVE                       DBGC1_EEVE1
#define DBGC1_EEVE_MASK                  DBGC1_EEVE1_MASK
#define PWME                             PWM0E
#define PWME_PWME0                       PWM0E_PWME0
#define PWME_PWME1                       PWM0E_PWME1
#define PWME_PWME2                       PWM0E_PWME2
#define PWME_PWME3                       PWM0E_PWME3
#define PWME_PWME4                       PWM0E_PWME4
#define PWME_PWME5                       PWM0E_PWME5
#define PWME_PWME6                       PWM0E_PWME6
#define PWME_PWME7                       PWM0E_PWME7
#define PWME_PWME0_MASK                  PWM0E_PWME0_MASK
#define PWME_PWME1_MASK                  PWM0E_PWME1_MASK
#define PWME_PWME2_MASK                  PWM0E_PWME2_MASK
#define PWME_PWME3_MASK                  PWM0E_PWME3_MASK
#define PWME_PWME4_MASK                  PWM0E_PWME4_MASK
#define PWME_PWME5_MASK                  PWM0E_PWME5_MASK
#define PWME_PWME6_MASK                  PWM0E_PWME6_MASK
#define PWME_PWME7_MASK                  PWM0E_PWME7_MASK
#define PWMPOL                           PWM0POL
#define PWMPOL_PPOL0                     PWM0POL_PPOL0
#define PWMPOL_PPOL1                     PWM0POL_PPOL1
#define PWMPOL_PPOL2                     PWM0POL_PPOL2
#define PWMPOL_PPOL3                     PWM0POL_PPOL3
#define PWMPOL_PPOL4                     PWM0POL_PPOL4
#define PWMPOL_PPOL5                     PWM0POL_PPOL5
#define PWMPOL_PPOL6                     PWM0POL_PPOL6
#define PWMPOL_PPOL7                     PWM0POL_PPOL7
#define PWMPOL_PPOL0_MASK                PWM0POL_PPOL0_MASK
#define PWMPOL_PPOL1_MASK                PWM0POL_PPOL1_MASK
#define PWMPOL_PPOL2_MASK                PWM0POL_PPOL2_MASK
#define PWMPOL_PPOL3_MASK                PWM0POL_PPOL3_MASK
#define PWMPOL_PPOL4_MASK                PWM0POL_PPOL4_MASK
#define PWMPOL_PPOL5_MASK                PWM0POL_PPOL5_MASK
#define PWMPOL_PPOL6_MASK                PWM0POL_PPOL6_MASK
#define PWMPOL_PPOL7_MASK                PWM0POL_PPOL7_MASK
#define PWMCLK                           PWM0CLK
#define PWMCLK_PCLK0                     PWM0CLK_PCLK0
#define PWMCLK_PCLK1                     PWM0CLK_PCLK1
#define PWMCLK_PCLK2                     PWM0CLK_PCLK2
#define PWMCLK_PCLK3                     PWM0CLK_PCLK3
#define PWMCLK_PCLK4                     PWM0CLK_PCLK4
#define PWMCLK_PCLK5                     PWM0CLK_PCLK5
#define PWMCLK_PCLK6                     PWM0CLK_PCLK6
#define PWMCLK_PCLK7                     PWM0CLK_PCLK7
#define PWMCLK_PCLK0_MASK                PWM0CLK_PCLK0_MASK
#define PWMCLK_PCLK1_MASK                PWM0CLK_PCLK1_MASK
#define PWMCLK_PCLK2_MASK                PWM0CLK_PCLK2_MASK
#define PWMCLK_PCLK3_MASK                PWM0CLK_PCLK3_MASK
#define PWMCLK_PCLK4_MASK                PWM0CLK_PCLK4_MASK
#define PWMCLK_PCLK5_MASK                PWM0CLK_PCLK5_MASK
#define PWMCLK_PCLK6_MASK                PWM0CLK_PCLK6_MASK
#define PWMCLK_PCLK7_MASK                PWM0CLK_PCLK7_MASK
#define PWMPRCLK                         PWM0PRCLK
#define PWMPRCLK_PCKA0                   PWM0PRCLK_PCKA0
#define PWMPRCLK_PCKA1                   PWM0PRCLK_PCKA1
#define PWMPRCLK_PCKA2                   PWM0PRCLK_PCKA2
#define PWMPRCLK_PCKB0                   PWM0PRCLK_PCKB0
#define PWMPRCLK_PCKB1                   PWM0PRCLK_PCKB1
#define PWMPRCLK_PCKB2                   PWM0PRCLK_PCKB2
#define PWMPRCLK_PCKA                    PWM0PRCLK_PCKA
#define PWMPRCLK_PCKB                    PWM0PRCLK_PCKB
#define PWMPRCLK_PCKA0_MASK              PWM0PRCLK_PCKA0_MASK
#define PWMPRCLK_PCKA1_MASK              PWM0PRCLK_PCKA1_MASK
#define PWMPRCLK_PCKA2_MASK              PWM0PRCLK_PCKA2_MASK
#define PWMPRCLK_PCKB0_MASK              PWM0PRCLK_PCKB0_MASK
#define PWMPRCLK_PCKB1_MASK              PWM0PRCLK_PCKB1_MASK
#define PWMPRCLK_PCKB2_MASK              PWM0PRCLK_PCKB2_MASK
#define PWMPRCLK_PCKA_MASK               PWM0PRCLK_PCKA_MASK
#define PWMPRCLK_PCKA_BITNUM             PWM0PRCLK_PCKA_BITNUM
#define PWMPRCLK_PCKB_MASK               PWM0PRCLK_PCKB_MASK
#define PWMPRCLK_PCKB_BITNUM             PWM0PRCLK_PCKB_BITNUM
#define PWMCAE                           PWM0CAE
#define PWMCAE_CAE0                      PWM0CAE_CAE0
#define PWMCAE_CAE1                      PWM0CAE_CAE1
#define PWMCAE_CAE2                      PWM0CAE_CAE2
#define PWMCAE_CAE3                      PWM0CAE_CAE3
#define PWMCAE_CAE4                      PWM0CAE_CAE4
#define PWMCAE_CAE5                      PWM0CAE_CAE5
#define PWMCAE_CAE6                      PWM0CAE_CAE6
#define PWMCAE_CAE7                      PWM0CAE_CAE7
#define PWMCAE_CAE0_MASK                 PWM0CAE_CAE0_MASK
#define PWMCAE_CAE1_MASK                 PWM0CAE_CAE1_MASK
#define PWMCAE_CAE2_MASK                 PWM0CAE_CAE2_MASK
#define PWMCAE_CAE3_MASK                 PWM0CAE_CAE3_MASK
#define PWMCAE_CAE4_MASK                 PWM0CAE_CAE4_MASK
#define PWMCAE_CAE5_MASK                 PWM0CAE_CAE5_MASK
#define PWMCAE_CAE6_MASK                 PWM0CAE_CAE6_MASK
#define PWMCAE_CAE7_MASK                 PWM0CAE_CAE7_MASK
#define PWMCTL                           PWM0CTL
#define PWMCTL_PFRZ                      PWM0CTL_PFRZ
#define PWMCTL_PSWAI                     PWM0CTL_PSWAI
#define PWMCTL_CON01                     PWM0CTL_CON01
#define PWMCTL_CON23                     PWM0CTL_CON23
#define PWMCTL_CON45                     PWM0CTL_CON45
#define PWMCTL_CON67                     PWM0CTL_CON67
#define PWMCTL_PFRZ_MASK                 PWM0CTL_PFRZ_MASK
#define PWMCTL_PSWAI_MASK                PWM0CTL_PSWAI_MASK
#define PWMCTL_CON01_MASK                PWM0CTL_CON01_MASK
#define PWMCTL_CON23_MASK                PWM0CTL_CON23_MASK
#define PWMCTL_CON45_MASK                PWM0CTL_CON45_MASK
#define PWMCTL_CON67_MASK                PWM0CTL_CON67_MASK
#define PWMCLKAB                         PWM0CLKAB
#define PWMCLKAB_PCLKAB0                 PWM0CLKAB_PCLKAB0
#define PWMCLKAB_PCLKAB1                 PWM0CLKAB_PCLKAB1
#define PWMCLKAB_PCLKAB2                 PWM0CLKAB_PCLKAB2
#define PWMCLKAB_PCLKAB3                 PWM0CLKAB_PCLKAB3
#define PWMCLKAB_PCLKAB4                 PWM0CLKAB_PCLKAB4
#define PWMCLKAB_PCLKAB5                 PWM0CLKAB_PCLKAB5
#define PWMCLKAB_PCLKAB6                 PWM0CLKAB_PCLKAB6
#define PWMCLKAB_PCLKAB7                 PWM0CLKAB_PCLKAB7
#define PWMCLKAB_PCLKAB0_MASK            PWM0CLKAB_PCLKAB0_MASK
#define PWMCLKAB_PCLKAB1_MASK            PWM0CLKAB_PCLKAB1_MASK
#define PWMCLKAB_PCLKAB2_MASK            PWM0CLKAB_PCLKAB2_MASK
#define PWMCLKAB_PCLKAB3_MASK            PWM0CLKAB_PCLKAB3_MASK
#define PWMCLKAB_PCLKAB4_MASK            PWM0CLKAB_PCLKAB4_MASK
#define PWMCLKAB_PCLKAB5_MASK            PWM0CLKAB_PCLKAB5_MASK
#define PWMCLKAB_PCLKAB6_MASK            PWM0CLKAB_PCLKAB6_MASK
#define PWMCLKAB_PCLKAB7_MASK            PWM0CLKAB_PCLKAB7_MASK
#define PWMSCLA                          PWM0SCLA
#define PWMSCLA_BIT0                     PWM0SCLA_BIT0
#define PWMSCLA_BIT1                     PWM0SCLA_BIT1
#define PWMSCLA_BIT2                     PWM0SCLA_BIT2
#define PWMSCLA_BIT3                     PWM0SCLA_BIT3
#define PWMSCLA_BIT4                     PWM0SCLA_BIT4
#define PWMSCLA_BIT5                     PWM0SCLA_BIT5
#define PWMSCLA_BIT6                     PWM0SCLA_BIT6
#define PWMSCLA_BIT7                     PWM0SCLA_BIT7
#define PWMSCLA_BIT0_MASK                PWM0SCLA_BIT0_MASK
#define PWMSCLA_BIT1_MASK                PWM0SCLA_BIT1_MASK
#define PWMSCLA_BIT2_MASK                PWM0SCLA_BIT2_MASK
#define PWMSCLA_BIT3_MASK                PWM0SCLA_BIT3_MASK
#define PWMSCLA_BIT4_MASK                PWM0SCLA_BIT4_MASK
#define PWMSCLA_BIT5_MASK                PWM0SCLA_BIT5_MASK
#define PWMSCLA_BIT6_MASK                PWM0SCLA_BIT6_MASK
#define PWMSCLA_BIT7_MASK                PWM0SCLA_BIT7_MASK
#define PWMSCLB                          PWM0SCLB
#define PWMSCLB_BIT0                     PWM0SCLB_BIT0
#define PWMSCLB_BIT1                     PWM0SCLB_BIT1
#define PWMSCLB_BIT2                     PWM0SCLB_BIT2
#define PWMSCLB_BIT3                     PWM0SCLB_BIT3
#define PWMSCLB_BIT4                     PWM0SCLB_BIT4
#define PWMSCLB_BIT5                     PWM0SCLB_BIT5
#define PWMSCLB_BIT6                     PWM0SCLB_BIT6
#define PWMSCLB_BIT7                     PWM0SCLB_BIT7
#define PWMSCLB_BIT0_MASK                PWM0SCLB_BIT0_MASK
#define PWMSCLB_BIT1_MASK                PWM0SCLB_BIT1_MASK
#define PWMSCLB_BIT2_MASK                PWM0SCLB_BIT2_MASK
#define PWMSCLB_BIT3_MASK                PWM0SCLB_BIT3_MASK
#define PWMSCLB_BIT4_MASK                PWM0SCLB_BIT4_MASK
#define PWMSCLB_BIT5_MASK                PWM0SCLB_BIT5_MASK
#define PWMSCLB_BIT6_MASK                PWM0SCLB_BIT6_MASK
#define PWMSCLB_BIT7_MASK                PWM0SCLB_BIT7_MASK
#define PWMCNT0                          PWM0CNT0
#define PWMCNT_ARR                       PWM0CNT_ARR
#define PWMCNT1                          PWM0CNT1
#define PWMCNT01                         PWM0CNT01
#define PWMCNT2                          PWM0CNT2
#define PWMCNT3                          PWM0CNT3
#define PWMCNT23                         PWM0CNT23
#define PWMCNT4                          PWM0CNT4
#define PWMCNT5                          PWM0CNT5
#define PWMCNT45                         PWM0CNT45
#define PWMCNT6                          PWM0CNT6
#define PWMCNT7                          PWM0CNT7
#define PWMCNT67                         PWM0CNT67
#define PWMPER0                          PWM0PER0
#define PWMPER_ARR                       PWM0PER_ARR
#define PWMPER1                          PWM0PER1
#define PWMPER01                         PWM0PER01
#define PWMPER2                          PWM0PER2
#define PWMPER3                          PWM0PER3
#define PWMPER23                         PWM0PER23
#define PWMPER4                          PWM0PER4
#define PWMPER5                          PWM0PER5
#define PWMPER45                         PWM0PER45
#define PWMPER6                          PWM0PER6
#define PWMPER7                          PWM0PER7
#define PWMPER67                         PWM0PER67
#define PWMDTY0                          PWM0DTY0
#define PWMDTY_ARR                       PWM0DTY_ARR
#define PWMDTY1                          PWM0DTY1
#define PWMDTY01                         PWM0DTY01
#define PWMDTY2                          PWM0DTY2
#define PWMDTY3                          PWM0DTY3
#define PWMDTY23                         PWM0DTY23
#define PWMDTY4                          PWM0DTY4
#define PWMDTY5                          PWM0DTY5
#define PWMDTY45                         PWM0DTY45
#define PWMDTY6                          PWM0DTY6
#define PWMDTY7                          PWM0DTY7
#define PWMDTY67                         PWM0DTY67
/*lint -restore  +esym(960,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
#endif
